[
  {
    "id": 1,
    "title": "Password Strength Analysis",
    "description": "As a cybersecurity professional, you need to evaluate password strength. Analyze the given passwords and identify which one provides the best security.",
    "short_description": "Evaluate password security based on modern standards",
    "difficulty": "Easy",
    "category": "Authentication",
    "points": 100,
    "content": "You need to evaluate which of these passwords is the strongest according to modern password security standards:\n\n1. password123\n2. P@ssw0rd!\n3. LongButSimplePasswordPhrase\n\nEnter the number of the strongest password (1, 2, or 3).\n\nNote: While option 2 has special characters and mixed case, modern security standards prioritize length over complexity. A longer passphrase (option 3) has significantly more entropy than a shorter password with special characters and common substitutions.",
    "solution": "3",
    "hint": "Consider both complexity (special characters, mixed case) and length. Longer passwords generally provide more entropy than shorter ones with special characters."
  },
  {
    "id": 2,
    "title": "Caesar Cipher Decryption",
    "description": "Caesar ciphers are classic encryption techniques. You've intercepted an encrypted message that was encrypted using a Caesar cipher with a key of 3.",
    "short_description": "Decrypt a message encrypted with a Caesar cipher",
    "difficulty": "Easy",
    "category": "Cryptography",
    "points": 100,
    "content": "Decrypt this message which was encoded using a Caesar cipher with key=3:\n\n'Fdhvdu flskhu lv edvlf'\n\nRemember: In a Caesar cipher with key=3, each letter is shifted 3 positions earlier in the alphabet. For example, 'D' becomes 'A', 'E' becomes 'B', etc.",
    "solution": "Caesar cipher is basic",
    "hint": "Shift each letter backwards by 3 positions in the alphabet. For example, 'F' → 'C', 'D' → 'A', etc."
  },
  {
    "id": 3,
    "title": "Phishing Detection",
    "description": "Phishing remains one of the most common attack vectors. Your task is to analyze a suspicious email and identify the signs that indicate it's a phishing attempt.",
    "short_description": "Identify indicators of a phishing email",
    "difficulty": "Medium",
    "category": "Social Engineering",
    "points": 150,
    "content": "You've received the following email:\n\n---\nFrom: security@amaz0n-security.net\nSubject: Urgent: Suspicious activity detected\n\nDear valued customer,\n\nWe've detected suspicious activity on your account. Your account will be suspended within 24 hours unless you verify your identity by clicking here: www.amaz0n-security.net/verify\n\nAmazon Security Team\n---\n\nWhat is the MAIN indicator that this is a phishing email? Enter one of: fake domain, urgency tactics, grammar errors, sender address",
    "solution": "fake domain",
    "hint": "Check the URL and sender address carefully. Legitimate companies use their official domains."
  },
  {
    "id": 4,
    "title": "SQL Injection Analysis",
    "description": "SQL injection is a common vulnerability in web applications. Your task is to analyze a potential SQL injection attempt and determine its impact.",
    "short_description": "Analyze the effect of a SQL injection attack",
    "difficulty": "Medium",
    "category": "Web Security",
    "points": 150,
    "content": "In a web application with the following login query:\n\nSELECT * FROM users WHERE username = '[INPUT1]' AND password = '[INPUT2]'\n\nA user submits this input for the username field:\nadmin' --\n\nWhat would be the effect of this input on a vulnerable system? Enter your answer as a brief phrase.",
    "solution": "bypass password check",
    "hint": "The -- characters are used for comments in SQL. What happens to the rest of the query after a comment?"
  },
  {
    "id": 5,
    "title": "Hash Verification Challenge",
    "description": "File integrity is crucial in cybersecurity. Your task is to use hash verification to determine which file has been tampered with.",
    "short_description": "Identify a modified file using hash verification",
    "difficulty": "Medium",
    "category": "Cryptography",
    "points": 150,
    "content": "You have three files with the following SHA-256 hashes:\n\nOriginal file: a8d4b32c98b7e3f96576da286da72964\nFile 1: a8d4b32c98b7e3f96576da286da72964\nFile 2: a8d4b32c98b7e3f96576da286da72965\n\nWhich file has been modified? Enter '1' or '2'.",
    "solution": "2",
    "hint": "Compare each hash with the original. Even a tiny change in the file will produce a completely different hash value."
  },
  {
    "id": 6,
    "title": "Network Traffic Analysis",
    "description": "As a security analyst, you've been asked to analyze suspicious network traffic to identify a potential data exfiltration attempt.",
    "short_description": "Analyze network traffic for data exfiltration",
    "difficulty": "Hard",
    "category": "Network Security",
    "points": 200,
    "content": "You've captured the following DNS requests from a suspicious host:\n\n08:15:22 - company-data.secret.to.malicious.com\n08:15:25 - financial-reports.secret.to.malicious.com\n08:15:28 - passwords.secret.to.malicious.com\n\nWhat technique is likely being used for data exfiltration? Enter: DNS tunneling, HTTP covert channel, ICMP tunneling, or FTP hidden transfer",
    "solution": "DNS tunneling",
    "hint": "Look at the domain format and how information might be encoded in the subdomain names."
  },
  {
    "id": 7,
    "title": "XSS Vulnerability Assessment",
    "description": "Cross-Site Scripting (XSS) remains a common web vulnerability. Your task is to identify potential XSS vulnerabilities in a web application.",
    "short_description": "Identify and analyze XSS vulnerabilities",
    "difficulty": "Hard",
    "category": "Web Security",
    "points": 200,
    "content": "A web application takes user input through a search field and displays it on the results page with this code:\n\n```html\n<div>You searched for: [user_input]</div>\n```\n\nWhat input would you use to test for XSS vulnerability? Provide a simple proof-of-concept payload.",
    "solution": "<script>alert(1)</script>",
    "hint": "Think about how you could inject JavaScript code that would execute when the page renders."
  },
  {
    "id": 8,
    "title": "Secure Coding Challenge",
    "description": "Identifying and fixing security vulnerabilities in code is a critical skill. Analyze the given code and identify the security vulnerability.",
    "short_description": "Find security vulnerabilities in code",
    "difficulty": "Hard",
    "category": "Secure Coding",
    "points": 200,
    "content": "Analyze this Python code snippet and identify the security vulnerability:\n\n```python\ndef process_file(filename):\n    # Process the user-provided filename\n    os.system('convert ' + filename + ' output.png')\n```\n\nWhat type of vulnerability is present? Enter: command injection, path traversal, buffer overflow, or race condition",
    "solution": "command injection",
    "hint": "Think about what happens if a user provides special characters that have meaning in shell commands."
  },
  {
    "id": 9,
    "title": "Multi-Factor Authentication",
    "description": "You need to implement the most secure authentication method for a financial application. Evaluate different MFA options.",
    "short_description": "Choose the best MFA implementation",
    "difficulty": "Medium",
    "category": "Authentication",
    "points": 150,
    "content": "Which of these multi-factor authentication methods provides the highest security for a banking application?\n\n1. Password + SMS code\n2. Password + Email link\n3. Password + Hardware token (like YubiKey)\n4. Password + Knowledge-based questions\n\nEnter the number of the most secure option.",
    "solution": "3",
    "hint": "Consider which factors can be intercepted or compromised through common attack vectors like SIM swapping or phishing."
  },
  {
    "id": 10,
    "title": "Encryption Key Management",
    "description": "Proper key management is crucial for maintaining the security of encrypted data. Identify the best practice for encryption key storage.",
    "short_description": "Identify best practices for key management",
    "difficulty": "Hard",
    "category": "Encryption",
    "points": 200,
    "content": "Which of these is the BEST practice for storing encryption keys in an enterprise environment?\n\n1. In the same database as the encrypted data\n2. In environment variables on the application server\n3. In a dedicated Hardware Security Module (HSM)\n4. In a configuration file with restricted permissions\n\nEnter the number of the best option.",
    "solution": "3",
    "hint": "Consider physical security, access controls, and separation of keys from the data they protect."
  },
  {
    "id": 11,
    "title": "Wireless Security Protocol",
    "description": "You need to recommend the most secure Wi-Fi security protocol for a corporate network. Compare different protocols to make the best choice.",
    "short_description": "Select the most secure Wi-Fi protocol",
    "difficulty": "Medium",
    "category": "Network Security",
    "points": 150,
    "content": "Which of these Wi-Fi security protocols provides the strongest security for a new corporate network deployment?\n\n1. WEP\n2. WPA\n3. WPA2\n4. WPA3\n\nEnter the number of the most secure protocol.",
    "solution": "4",
    "hint": "Consider which protocol is the newest and addresses vulnerabilities found in previous versions."
  },
  {
    "id": 12,
    "title": "OWASP Top 10 Analysis",
    "description": "The OWASP Top 10 lists the most critical web application security risks. Identify which vulnerability is being exploited in a given scenario.",
    "short_description": "Identify OWASP Top 10 vulnerabilities",
    "difficulty": "Hard",
    "category": "Web Security",
    "points": 200,
    "content": "A web application allows users to upload profile pictures without validating the file type or scanning for malicious content. An attacker uploads a .php file disguised as an image, which executes when accessed via the web server.\n\nWhich OWASP Top 10 vulnerability is primarily being exploited? Enter one of: Injection, Broken Authentication, Sensitive Data Exposure, XML External Entities, Broken Access Control, Security Misconfiguration, Cross-Site Scripting, Insecure Deserialization, Using Components with Known Vulnerabilities, Insufficient Logging & Monitoring",
    "solution": "Security Misconfiguration",
    "hint": "Think about server configuration issues that allow execution of uploaded files."
  },
  {
    "id": 13,
    "title": "Public Key Cryptography",
    "description": "Understanding public key cryptography is essential for secure communications. Analyze how keys are used in different operations.",
    "short_description": "Understand public/private key usage",
    "difficulty": "Medium",
    "category": "Cryptography",
    "points": 150,
    "content": "In public key cryptography, which key would you use to VERIFY a digital signature?\n\n1. The sender's private key\n2. The sender's public key\n3. The recipient's private key\n4. The recipient's public key\n\nEnter the number of the correct option.",
    "solution": "2",
    "hint": "Think about who creates the signature and who needs to verify it. The key used for verification must be widely available."
  },
  {
    "id": 14,
    "title": "Incident Response",
    "description": "Proper incident response procedures are critical during a security breach. Identify the correct sequence of steps in the incident response process.",
    "short_description": "Order incident response steps correctly",
    "difficulty": "Hard",
    "category": "Security Management",
    "points": 200,
    "content": "Put these incident response steps in the correct order:\n\nA. Recovery\nB. Identification\nC. Containment\nD. Eradication\nE. Preparation\nF. Lessons Learned\n\nEnter the correct sequence as a string of letters (e.g., 'ABCDEF').",
    "solution": "EBCDAF",
    "hint": "Think about logical progression - you need to prepare before an incident occurs, and learn lessons after recovery is complete."
  },
  {
    "id": 15,
    "title": "Secure Password Storage",
    "description": "Storing passwords securely is critical for protecting user accounts. Evaluate different password storage methods to identify the most secure approach.",
    "short_description": "Identify secure password storage methods",
    "difficulty": "Medium",
    "category": "Authentication",
    "points": 150,
    "content": "Which of these methods is the MOST secure for storing user passwords in a database?\n\n1. MD5 hash\n2. SHA-256 hash\n3. Bcrypt with salt\n4. AES-256 encryption with a system-wide key\n\nEnter the number of the most secure option.",
    "solution": "3",
    "hint": "Consider which method is specifically designed for password storage and includes protection against rainbow table attacks and brute force attempts."
  }
]